#### BuiltInFailures.SystemsFailures Members

---

|  |
| --- |
| BuiltInFailures SystemsFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SystemsFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AddingOtherConnectedMembersToSystem | "You have selected elements that are connected to other elements. These elements will also be added to the System." |
| Public property Static member | CircuitWorksetClosedWarning | The workset of the circuit is closed so the circuit path will not be displayed. |
| Public property Static member | CreatePartsWithInvalidService | Parts were not created because a system's service is undefined. |
| Public property Static member | CreatePartsWithInvalidSystem | Parts were not created because the element does not have a valid system. |
| Public property Static member | CreatePartsWithoutDabasebase | Parts were not created because fabrication configuration is not available. |
| Public property Static member | DefaultSystemOver50Elems | The default system "[Element Name]" is now over 50 elements. To improve performance, Revit is no longer calculating the critical path pressure drop and the more complex duct sizing has been disabled. If you want to use these features, you must define logical systems in the model instead of using the default system. |
| Public property Static member | ElementsBelongToOtherSystem | You have selected elements that are already part of other Systems that have assigned Equipment. The elements you selected cannot be added to this System. |
| Public property Static member | FamilyDoesntMatchSystemProperties | The family no longer matches the properties for the System. Disconnect the family from the System? |
| Public property Static member | FamilyDoesntMatchSystemPropertiesWasDisconnected | The family no longer matches the properties for the System. Disconnect the family from the System? |
| Public property Static member | MismatchSystemType | Cannot add [Element] to System. The System Type for the available connector does not match the System Type ([Type Name]) for the System. |
| Public property Static member | PastePartsWithInvalidService | Parts were not pasted because fabrication configuration is not available or service is not valid in the type properties for the system. |
| Public property Static member | SelectedElementsArePartOfOtherSystem | You have selected elements that are already part of other System. They will be removed from the original Systems and added to this one. |

# See Also

BuiltInFailures SystemsFailures Class

Autodesk.Revit.DB Namespace